In [1]:
import pandas as pd

In [3]:
dates_df = pd.read_csv('dates.csv')
dates_df.sample(n=5)

                      date
36657  2012-11-24 23:45:19
76462  2007-05-14 21:23:02
77192  2005-01-10 22:37:35
37501  2017-06-24 06:07:11
7321   2017-12-25 21:57:36

In [11]:
movies_df = pd.read_csv('movies.csv')
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
rate1_df = pd.read_csv('ratings1.csv')
rate1_df.head()

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [6]:
rate2_df = pd.read_csv('ratings2.csv')
rate2_df.head()

   userId  movieId  rating
0     274     5621     2.0
1     274     5630     3.0
2     274     5667     3.5
3     274     5679     3.5
4     274     5690     3.0

In [7]:
movies_df['movieId'].nunique()

9742

In [8]:
rate1_df['userId'].nunique()

274

In [9]:
dates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    100836 non-null  object
dtypes: object(1)
memory usage: 787.9+ KB

In [10]:
dates_df['date'] = pd.to_datetime(dates_df['date'])
dates_df['date'].dt.year.mode()[0]

2000